**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

import pandas as pd

bird_data = pd.DataFrame(data)
bird_data['index'] = labels
bird_data.set_index('index', inplace = True)
bird_data

            birds  age  visits priority
index
a          Cranes  3.5       2      yes
b          Cranes  4.0       4      yes
c         plovers  1.5       3       no
d      spoonbills  NaN       4      yes
e      spoonbills  6.0       3       no
f          Cranes  3.0       4       no
g         plovers  5.5       2       no
h          Cranes  NaN       2      yes
i      spoonbills  8.0       3       no
j      spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [2]:
bird_data.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [3]:
bird_data.head(2)

        birds  age  visits priority
index
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [4]:
bird_data[['birds','age']]

            birds  age
index
a          Cranes  3.5
b          Cranes  4.0
c         plovers  1.5
d      spoonbills  NaN
e      spoonbills  6.0
f          Cranes  3.0
g         plovers  5.5
h          Cranes  NaN
i      spoonbills  8.0
j      spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [5]:
bird_data[['birds','age','visits']].iloc[[2,3,7]]

            birds  age  visits
index
c         plovers  1.5       3
d      spoonbills  NaN       4
h          Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [6]:
bird_data[bird_data['visits'] < 4]

            birds  age  visits priority
index
a          Cranes  3.5       2      yes
c         plovers  1.5       3       no
e      spoonbills  6.0       3       no
g         plovers  5.5       2       no
h          Cranes  NaN       2      yes
i      spoonbills  8.0       3       no
j      spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [7]:
bird_data[bird_data['age'].isnull()][['birds','visits']]

            birds  visits
index
d      spoonbills       4
h          Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [8]:
bird_data[(bird_data['birds'] == 'Cranes') & (bird_data['age'] < 4)]

        birds  age  visits priority
index
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [9]:
bird_data[(bird_data['age'] > 2) & (bird_data['age'] < 4)]

        birds  age  visits priority
index
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no

**10. Find the total number of visits of the bird Cranes**

In [10]:
bird_data[bird_data['birds'] == 'Cranes']['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [11]:
bird_data[['birds','age']].groupby('birds').mean()

            age
birds
Cranes      3.5
plovers     3.5
spoonbills  6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [12]:
new_data = {'birds': ['Cranes'],
        'age': [7],
        'visits': [2],
        'priority': ['yes'],
         'index': ['k']}

k_data = pd.DataFrame(new_data)
k_data.set_index('index', inplace = True)

frames = [bird_data,k_data]
result = pd.concat(frames)
result

            birds  age  visits priority
index
a          Cranes  3.5       2      yes
b          Cranes  4.0       4      yes
c         plovers  1.5       3       no
d      spoonbills  NaN       4      yes
e      spoonbills  6.0       3       no
f          Cranes  3.0       4       no
g         plovers  5.5       2       no
h          Cranes  NaN       2      yes
i      spoonbills  8.0       3       no
j      spoonbills  4.0       2       no
k          Cranes  7.0       2      yes

In [13]:
bird_data = result.iloc[:-1]
bird_data

            birds  age  visits priority
index
a          Cranes  3.5       2      yes
b          Cranes  4.0       4      yes
c         plovers  1.5       3       no
d      spoonbills  NaN       4      yes
e      spoonbills  6.0       3       no
f          Cranes  3.0       4       no
g         plovers  5.5       2       no
h          Cranes  NaN       2      yes
i      spoonbills  8.0       3       no
j      spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [14]:
bird_data[['birds']].groupby('birds').size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [15]:
bird_data.sort_values(['age'],ascending=[0])

            birds  age  visits priority
index
i      spoonbills  8.0       3       no
e      spoonbills  6.0       3       no
g         plovers  5.5       2       no
b          Cranes  4.0       4      yes
j      spoonbills  4.0       2       no
a          Cranes  3.5       2      yes
f          Cranes  3.0       4       no
c         plovers  1.5       3       no
d      spoonbills  NaN       4      yes
h          Cranes  NaN       2      yes

In [16]:
bird_data.sort_values(['visits'],ascending=[1])

            birds  age  visits priority
index
a          Cranes  3.5       2      yes
g         plovers  5.5       2       no
h          Cranes  NaN       2      yes
j      spoonbills  4.0       2       no
c         plovers  1.5       3       no
e      spoonbills  6.0       3       no
i      spoonbills  8.0       3       no
b          Cranes  4.0       4      yes
d      spoonbills  NaN       4      yes
f          Cranes  3.0       4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [17]:
bird_data['priority'].replace(['yes','no'],[1,0])

index
a    1
b    1
c    0
d    1
e    0
f    0
g    0
h    1
i    0
j    0
Name: priority, dtype: int64

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [18]:
bird_data['birds'].replace('Cranes','trumpeters')

index
a    trumpeters
b    trumpeters
c       plovers
d    spoonbills
e    spoonbills
f    trumpeters
g       plovers
h    trumpeters
i    spoonbills
j    spoonbills
Name: birds, dtype: object

References :

http://cmdlinetips.com/2018/02/how-to-sort-pandas-dataframe-by-columns-and-row/

https://www.kaggle.com/vj1998/excercise-to-get-started-with-pandas-for-beginners

https://medium.com/@sajuas/learn-pandas-by-comparing-with-sql-29ad113aed75

https://erikrood.com/Python_References/add_new_col_df_default_value_final.html

https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.replace.html